XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
/*
 * Copyright (C) 2019-2020 Alibaba Group Holding Limited
 */

#include <stdio.h>
#include <ctype.h>
#include <stdlib.h>
#include <string.h>
#include <aos/aos.h>
#include <aos/debug.h>
#include <uservice/uservice.h>
#include <devices/netdrv.h>

#include <lwip/apps/dhcps.h>
#include <lwip/netifapi.h>
#include <lwip_netconf.h>
#include <lwip/dns.h>

#include <netif/ethernet.h>
#include <devices/wifi.h>
#include <devices/impl/wifi_impl.h>
#include <devices/rtl8723ds.h>

#include "wifi_io.h"
#include "drv/gpio.h"
#ifdef CONFIG_CSI_V2
#include "drv/pin.h"
#include <drv/gpio_pin.h>
#else
#include "pinmux.h"
#include "pin_name.h"
#endif
#include <ulog/ulog.h>

#include "wifi_constants.h"
#include "wifi_conf.h"

#include "rtl8723ds_devops.h"

#define MAX_AP_RECORD 100
#define IEEE80211_FCTL_TODS 0x0100
#define IEEE80211_FCTL_FROMDS 0x0200
#define IEEE80211_FTYPE_MGMT 0x0000
#define IEEE80211_FTYPE_CTL 0x0004
#define IEEE80211_FTYPE_DATA 0x0008
#define ETH_ALEN 6

#if !defined(MIN)
#define MIN(a, b) ((a) < (b) ? (a) : (b))
#endif

typedef struct {
    rvm_dev_t   device;
    uint8_t mode;
    void (*write_event)(rvm_dev_t *dev, int event_id, void *priv);
    void *priv;
} wifi_dev_t;

#define TAG "WIFI"

//static const char *TAG = "RTL8723DS OPS";

//advise: hal functions using global variable here may be deleted
static rvm_hal_wifi_lpm_mode_t       g_wifi_lpm_mode;
static rtw_country_code_t    g_country;
static rvm_hal_wifi_promiscuous_cb_t g_monitor_cb;
static rvm_hal_wifi_mgnt_cb_t        g_monitor_mgnt_cb;
static rvm_hal_wifi_event_func *     g_evt_func;
static rvm_hal_wifi_config_t         g_config;
static rtl8723ds_gpio_pin    g_gpio_config;
#ifdef CONFIG_CSI_V2
csi_gpio_t  *                power_pin;
#else
static gpio_pin_handle_t     power_pin;
#endif
static rvm_dev_t *               wifi_evt_dev;
static rvm_hal_wifi_ap_record_t *    g_ap_records;
static int                   scan_count;
extern rtw_mode_t            wifi_mode;
static int                   wifi_disconnected_times;
static int                   sta_task_running;
static int                   wifi_open_mode;
static int                   wifi_crashed;
static int                   connect_failed_reason;

extern struct netif xnetif[NET_IF_NUM];

extern void dhcps_deinit(void);

void dhcps_set_addr_pool(int addr_pool_set, ip_addr_t *addr_pool_start, ip_addr_t *addr_pool_end);
static void rtl8723ds_wifi_handshake_done_hdl(char *buf, int buf_len, int flags, void *userdata);
static void rtl8723ds_wifi_connected_hdl(char *buf, int buf_len, int flags, void *userdata);
void        rtl8723ds_scan_report_hdl(char *buf, int buf_len, int flags, void *userdata);
static void rtl8723ds_scan_done_hdl(char *buf, int buf_len, int flags, void *userdata);
static void rtl8723ds_get_security_scan_done_hdl(char *buf, int buf_len, int flags, void *userdata);

void rtl8723ds_set_invalid()
{
    wifi_crashed = 1;
}


#define DRIVER_INVALID_RETURN_VAL \
    do { \
        if (wifi_crashed) \
            return -1; \
    } while (0)

#define DRIVER_INVALID_RETURN \
    do { \
        if (wifi_crashed) \
            return; \
    } while (0)


#define RTL8723DS_NET_DRIVER
#ifdef RTL8723DS_NET_DRIVER

int rtl8723ds_set_mac_addr(rvm_dev_t *dev, const uint8_t *mac)
{
    /** write this mac address will write to efuse, forbidden this */
    return -1;

#if 0
    char mac_str[18] = {0};
    sprintf(mac_str, MAC_FMT, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return wifi_set_mac_address(mac_str);
#endif
}


int rtl8723ds_get_mac_addr(rvm_dev_t *dev, uint8_t *mac)
{
    DRIVER_INVALID_RETURN_VAL;

    int mac_tmp[6];
    char mac_str[18] = {0};
    
    int ret = wifi_get_mac_address(mac_str);

    sscanf(mac_str, "%02x:%02x:%02x:%02x:%02x:%02x",
           &mac_tmp[0], &mac_tmp[1], &mac_tmp[2],
           &mac_tmp[3], &mac_tmp[4], &mac_tmp[5]);

    mac[0] = mac_tmp[0];
    mac[1] = mac_tmp[1];
    mac[2] = mac_tmp[2];
    mac[3] = mac_tmp[3];
    mac[4] = mac_tmp[4];
    mac[5] = mac_tmp[5];

    return ret;
}

int rtl8723ds_set_dns_server(rvm_dev_t *dev, ip_addr_t ipaddr[], uint32_t num)
{
    int n, i;

    n = MIN(num, DNS_MAX_SERVERS);

    for (i = 0; i < n; i ++) {
        dns_setserver(i, &ipaddr[i]);
    }

    return n;
}

int rtl8723ds_get_dns_server(rvm_dev_t *dev, ip_addr_t ipaddr[], uint32_t num)
{
    int n, i;

    n = MIN(num, DNS_MAX_SERVERS);

    for (i = 0; i < n; i ++) {
        if (!ip_addr_isany(dns_getserver(i))) {
            memcpy(&ipaddr[i], dns_getserver(i), sizeof(ip_addr_t));
        } else {
            return i;
        }
    }

    return n;
}

int rtl8723ds_set_hostname(rvm_dev_t *dev, const char *name)
{
#if LWIP_NETIF_HOSTNAME
    struct netif *netif = &xnetif[0];
    netif_set_hostname(netif, name);
    return 0;
#else
    return -1;
#endif
}

const char *rtl8723ds_get_hostname(rvm_dev_t *dev)
{
#if LWIP_NETIF_HOSTNAME
    struct netif *netif = &xnetif[0];
    return netif_get_hostname(netif);
#else
    return NULL;
#endif
}

void net_status_callback(struct netif *netif)
{
    if (!ip_addr_isany(ip_2_ip4(&netif->ip_addr))) {
        event_publish(EVENT_NET_GOT_IP, NULL);
    }
}

static int rtl8723ds_start_dhcp(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    struct netif *netif = &xnetif[0]; //netif_find("en0");
    aos_check_return_einval(netif);

    if (!netif_is_link_up(netif)) {
        return -1;
    }

    netif_set_ipaddr(netif, NULL);
    netif_set_netmask(netif, NULL);
    netif_set_gw(netif, NULL);

    netif_set_status_callback(netif, net_status_callback);

    return netifapi_dhcp_start(netif);
}

static int rtl8723ds_stop_dhcp(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    struct netif *netif = &xnetif[0]; //netif_find("en0");
    aos_check_return_einval(netif);

    netifapi_dhcp_stop(netif);

    return 0;
}

static int rtl8723ds_set_ipaddr(rvm_dev_t *dev, const ip_addr_t *ipaddr, const ip_addr_t *netmask,
                                const ip_addr_t *gw)
{
    return -1;
}

static int rtl8723ds_get_ipaddr(rvm_dev_t *dev, ip_addr_t *ipaddr, ip_addr_t *netmask, ip_addr_t *gw)
{
    DRIVER_INVALID_RETURN_VAL;

    struct netif *netif = &xnetif[0]; //netif_find("en0");
    aos_check_return_einval(netif && ipaddr && netmask && gw);

    ip_addr_copy(*(ip4_addr_t *)ip_2_ip4(ipaddr), *netif_ip_addr4(netif));
    ip_addr_copy(*(ip4_addr_t *)ip_2_ip4(gw), *netif_ip_gw4(netif));
    ip_addr_copy(*(ip4_addr_t *)ip_2_ip4(netmask), *netif_ip_netmask4(netif));

