XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
    return 0;
}

int rtl8723ds_subscribe(rvm_dev_t *dev, uint32_t event, event_callback_t cb, void *param)
{
    return -1;
}

int rtl8723ds_ping_remote(rvm_dev_t *dev, int type, char *remote_ip)
{
    return -1;
}

static net_ops_t rtl8723ds_net_driver = {
    .set_mac_addr   = rtl8723ds_set_mac_addr,
    .get_mac_addr   = rtl8723ds_get_mac_addr,
    .set_dns_server = rtl8723ds_set_dns_server,
    .get_dns_server = rtl8723ds_get_dns_server,
    .set_hostname   = rtl8723ds_set_hostname,
    .get_hostname   = rtl8723ds_get_hostname,
    .start_dhcp     = rtl8723ds_start_dhcp,
    .stop_dhcp      = rtl8723ds_stop_dhcp,
    .set_ipaddr     = rtl8723ds_set_ipaddr,
    .get_ipaddr     = rtl8723ds_get_ipaddr,
    .subscribe      = rtl8723ds_subscribe,
    .ping           = rtl8723ds_ping_remote,
};

#endif

#define RTL8723DS_WIFI_DRIVER
#ifdef RTL8723DS_WIFI_DRIVER

static void wifi_promisc_hdl(u8 *in_buf, unsigned int buf_len, void *userdata)
{
    ieee80211_frame_info_t *    info = (ieee80211_frame_info_t *)userdata;
    rvm_hal_wifi_promiscuous_pkt_t *    buf  = aos_malloc(sizeof(rvm_hal_wifi_promiscuous_pkt_t) + buf_len);
    rvm_hal_wifi_promiscuous_pkt_type_t type = WIFI_PKT_MISC;

    buf->rx_ctrl.rssi    = info->rssi;
    buf->rx_ctrl.sig_len = buf_len;
    memcpy(buf->payload, in_buf, buf_len);

    if ((info->i_fc & 0xc) == IEEE80211_FTYPE_DATA) {
        type = WIFI_PKT_DATA;
    } else if ((info->i_fc & 0xc) == IEEE80211_FTYPE_MGMT) {
        type = WIFI_PKT_MGMT;
    } else if ((info->i_fc & 0xc) == IEEE80211_FTYPE_CTL) {
        type = WIFI_PKT_CTRL;
    }

    g_monitor_cb(buf, type);
    aos_free(buf);
}

static void wifi_set_sta_mode()
{
    int mode = 0;
    //Check if in AP mode
    //wext_get_mode(WLAN0_NAME, &mode);
    DRIVER_INVALID_RETURN;

    if(rltk_wlan_running(WLAN0_IDX)) {
        wext_get_mode(WLAN0_NAME, &mode);

        if (mode == IW_MODE_INFRA) {
            return;
        }
	}

#if CONFIG_LWIP_LAYER
    dhcps_deinit();
#endif
    wifi_off();
    rtw_mdelay_os(20);

    if (wifi_on(RTW_MODE_STA) < 0) {
        LOGI(TAG, "[%s]: Wifi on failed!Do zconfig reset!", __FUNCTION__);
    }

    wext_set_mode(WLAN0_NAME, IW_MODE_INFRA);

    wifi_disable_powersave();

    return;
}

static void rtl8723ds_handshake_failed_hdl(char *buf, int buf_len, int flags, void *userdata)
{
    wifi_unreg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl);

    connect_failed_reason = NET_DISCON_REASON_WIFI_PSK_ERR;
}

/**
    netmgr_reset, which calls wifi_off, will also goes here
*/
static void rtl8723ds_wifi_disconn_hdl(char *buf, int buf_len, int flags, void *userdata)
{
    wifi_unreg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl);
    wifi_reg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl,
                           NULL);
    wifi_reg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl, NULL);

    LOGD(TAG, "############### Disconnected ###############\n");

    netif_set_link_down(&xnetif[0]);
    event_publish(EVENT_WIFI_LINK_DOWN, (void *)(size_t)connect_failed_reason);
}

/**
    Group key handshake will also goes here
*/
static void rtl8723ds_wifi_handshake_done_hdl(char *buf, int buf_len, int flags, void *userdata)
{
    wifi_unreg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl);
    wifi_reg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl, NULL);
    wifi_unreg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);

    wifi_disconnected_times = 0;
    LOGD(TAG, "@@@@@@@@@@@@@@ Connection Success @@@@@@@@@@@@@@\n");
    netif_set_link_up(&xnetif[0]);
    event_publish(EVENT_WIFI_LINK_UP, NULL);
}

static void rtl8723ds_wifi_connected_hdl(char *buf, int buf_len, int flags, void *userdata)
{
    if (wifi_open_mode) {
        wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);
        wifi_unreg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE,
                                 rtl8723ds_wifi_handshake_done_hdl);
        wifi_reg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl, NULL);

        LOGD(TAG, "Call for 4-way handshake\n");
        rtl8723ds_wifi_handshake_done_hdl(buf, buf_len, flags, userdata);
    } else {

        wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);
        wifi_reg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl,
                               NULL);
        wifi_reg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl, NULL);

        LOGD(TAG, "Wait for 4-way handshake\n");
    }
}

int rtl8723ds_get_security(char *ssid, rtw_security_t *security_type)
{
    static int scan_done;
    int        hit = 0;
    int        i   = 0;

    int scan_type = RTW_SCAN_COMMAMD << 4 | RTW_SCAN_TYPE_ACTIVE;
    int bss_type  = RTW_BSS_TYPE_ANY;
    u16 flags     = scan_type | (bss_type << 8);
    scan_done     = 0;
    rvm_hal_wifi_ap_record_t *    ap_records;

    ap_records = aos_zalloc(sizeof(rvm_hal_wifi_ap_record_t) * MAX_AP_RECORD);
    scan_count = 0;

    wifi_reg_event_handler(WIFI_EVENT_SCAN_RESULT_REPORT, rtl8723ds_scan_report_hdl, ap_records);
    wifi_reg_event_handler(WIFI_EVENT_SCAN_DONE, rtl8723ds_get_security_scan_done_hdl, &scan_done);
    wext_set_scan(WLAN0_NAME, NULL, 0, flags);

    while (scan_done == 0) {
        aos_msleep(100);
    }

    wifi_unreg_event_handler(WIFI_EVENT_SCAN_DONE, rtl8723ds_get_security_scan_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_SCAN_RESULT_REPORT, rtl8723ds_scan_report_hdl);

    for (i = 0; i < scan_count; i++) {
        rvm_hal_wifi_ap_record_t *ap_record = &ap_records[i];
        if (strcmp((char *)ap_record->ssid, ssid) == 0) {
            *security_type = ap_record->encryptmode;

