XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
            if ((ap_record->encryptmode == WIFI_ENC_OPEN) &&
                (ap_record->authmode == WIFI_AUTH_OPEN))
                *security_type = RTW_SECURITY_OPEN;
            else if ((ap_record->encryptmode == WIFI_ENC_WEP) &&
                     (ap_record->authmode == WIFI_AUTH_OPEN))
                *security_type = RTW_SECURITY_WEP_PSK;
            else if ((ap_record->encryptmode == WIFI_ENC_WEP) &&
                     (ap_record->authmode == WIFI_AUTH_WEP))
                *security_type = RTW_SECURITY_WEP_SHARED;
            else if ((ap_record->encryptmode == WIFI_ENC_TKIP) &&
                     (ap_record->authmode == WIFI_AUTH_WPA_PSK))
                *security_type = RTW_SECURITY_WPA_TKIP_PSK;
            else if ((ap_record->encryptmode == WIFI_ENC_AES) &&
                     (ap_record->authmode == WIFI_AUTH_WPA_PSK))
                *security_type = RTW_SECURITY_WPA_AES_PSK;
            else if ((ap_record->encryptmode == WIFI_ENC_AES) &&
                     (ap_record->authmode == WIFI_AUTH_WPA2_PSK))
                *security_type = RTW_SECURITY_WPA2_AES_PSK;
            else if ((ap_record->encryptmode == WIFI_ENC_TKIP) &&
                     (ap_record->authmode == WIFI_AUTH_WPA2_PSK))
                *security_type = RTW_SECURITY_WPA2_TKIP_PSK;
            else if ((ap_record->encryptmode == WIFI_ENC_TKIP_AES_MIX) &&
                     (ap_record->authmode == WIFI_AUTH_WPA2_PSK))
                *security_type = RTW_SECURITY_WPA2_MIXED_PSK;
            else if ((ap_record->encryptmode == WIFI_ENC_TKIP_AES_MIX) &&
                     (ap_record->authmode == WIFI_AUTH_WPA_WPA2_PSK))
                *security_type = RTW_SECURITY_WPA_WPA2_MIXED;
            else {
                LOGE(TAG, "Error security %d,%d\n", ap_record->encryptmode, ap_record->authmode);
                *security_type = RTW_SECURITY_UNKNOWN;
                break;
            }
            hit = 1;
            break;
        }
    }

    aos_free(ap_records);
    if (hit == 0) {
        LOGE(TAG, "Target AP not found\n");
        connect_failed_reason = NET_DISCON_REASON_WIFI_NOEXIST;
        return -1;
    } else {
        //LOGD(TAG, ">Get  security %d\n", *security_type);
        return 0;
    }
}

void wifi_start_sta_task(void *arg)
{
    DRIVER_INVALID_RETURN;

    int            ret    = 0;
    rvm_hal_wifi_config_t *config = (rvm_hal_wifi_config_t *)arg;

    rtw_security_t   security_type;
    char            *password;
    int              password_len;
    int              key_id;

    sta_task_running        = 1;
    wifi_disconnected_times = 0;
    connect_failed_reason = 0;

    /** avoid wifi_off send wifi disconnect event */
    wifi_unreg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);
    
	if((rltk_wlan_running(WLAN0_IDX) != 0) ||
		(rltk_wlan_running(WLAN1_IDX) != 0)) {
		/** disable auto reconnect */
#if CONFIG_AUTO_RECONNECT
        wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
#endif
    }

#if CONFIG_AUTO_RECONNECT
    wifi_wait_auto_reconnect();
#endif

    wifi_set_sta_mode();
    
#if CONFIG_UNICAST_WAKE
    wext_wowlan_unicast_wake_ctrl(WLAN0_NAME, 1);
#endif

#if CONFIG_AUTO_RECONNECT
    wifi_set_autoreconnect(RTW_AUTORECONNECT_FINITE);
#endif

    if (*(config->ssid) == '\0') {
        goto exit;
    }

    if(*(config->password) == '\0') {
        wifi_open_mode = 1;
        security_type = RTW_SECURITY_OPEN;
        password = NULL;
        password_len = 0;
        key_id = 0;
    } else {
        wifi_open_mode = 0;
        security_type = RTW_SECURITY_WPA_WPA2_MIXED;
        password = config->password;
        password_len = strlen(config->password);
        key_id = 0;
    }

    wifi_reg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl, NULL);

    /** ''wifi_connect' will connect only once and exit no matter connected or not */
    ret = wifi_connect(config->ssid, security_type, password,
                      strlen(config->ssid), password_len, key_id, NULL);

    if (ret == RTW_SUCCESS) {
        LOGD(TAG, "@@@@@@@@@@@@@@ Connection Success @@@@@@@@@@@@@@\n");
        netif_set_link_up(&xnetif[0]);
        event_publish(EVENT_WIFI_LINK_UP, NULL);
        wifi_unreg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl);
        wifi_reg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl, NULL);
        sta_task_running = 0;
        return;
    }

    wifi_set_sta_mode();

    LOGE(TAG, "ERROR: STA Task, wifi connect failed! try another");

    password_len = strlen(config->password);

    ret = rtl8723ds_get_security(config->ssid, &security_type);

    if (ret != RTW_SUCCESS) {
        event_publish(EVENT_WIFI_LINK_DOWN, (void *)(size_t)connect_failed_reason);
        goto exit;
    }

    if (security_type == RTW_SECURITY_UNKNOWN) {
        /* force connect  wifi */
        LOGE(TAG, "Scan fail, auto security !\n");
        if (password_len != 0)
            security_type = RTW_SECURITY_WPA_WPA2_MIXED;
        else
            security_type = RTW_SECURITY_OPEN;
    }

    if (security_type == RTW_SECURITY_OPEN) {
        if (password_len != 0) {
            LOGE(TAG, "Security mismatch1 !\n");
            password_len = 0;
        }
        password       = NULL;
        key_id         = 0;
        wifi_open_mode = 1;
    } else if (security_type == RTW_SECURITY_WEP_PSK) {
        if (password_len == 0) {
            LOGE(TAG, "Security mismatch2 !\n");
            event_publish(EVENT_WIFI_LINK_DOWN, (void *)(size_t)connect_failed_reason);
            goto exit;
        }
        password       = config->password;
        key_id         = 0;
        wifi_open_mode = 1;
    }  else {
        if (password_len == 0) {
            LOGE(TAG, "Security mismatch3 !\n");
            event_publish(EVENT_WIFI_LINK_DOWN, (void *)(size_t)connect_failed_reason);
            goto exit;
        }
        password       = config->password;
        key_id         = 0;
        wifi_open_mode = 0;
    }

    wifi_reg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl, NULL);

    wifi_reg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE,
                           rtl8723ds_wifi_handshake_done_hdl, NULL);
    wifi_reg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl, NULL);

    /** ''wifi_connect' will connect only once and exit no matter connected or not */
    ret = wifi_connect(config->ssid, security_type, password,
                       strlen(config->ssid), password_len, key_id, NULL);

    if (ret != RTW_SUCCESS) {
        LOGE(TAG, "ERROR: STA Task, wifi connect failed!: %d", ret);

        if (ret == RTW_INVALID_KEY || ret == RTW_TIMEOUT || ret == RTW_NOMEM) {
            /* password_len not match publish WIFI DOWN */
            event_publish(EVENT_WIFI_LINK_DOWN, (void *)(size_t)connect_failed_reason);
        }
        goto exit;
    } else {
        sta_task_running = 0;
        return;
    }

