XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
exit:
    wifi_unreg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl);
    wifi_reg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl, NULL);

    wifi_reg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE,
                           rtl8723ds_wifi_handshake_done_hdl, NULL);
    wifi_reg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl, NULL);
    sta_task_running = 0;
    //aos_task_exit(0);
}

/*
    return---- 0:succese, -1: fail
*/
int wifi_start_softap(rvm_hal_wifi_config_t *config)
{
    DRIVER_INVALID_RETURN_VAL;

    int timeout = 20;

    ip_addr_t     ipaddr;
    ip_addr_t     netmask;
    ip_addr_t     gw;
    ip_addr_t     ipaddr_pool_start;
    ip_addr_t     ipaddr_pool_end;
    struct netif *pnetif = &xnetif[0];


    IP4_ADDR(&ipaddr, 192, 168, 1, 1);
    IP4_ADDR(&netmask, 255, 255, 255, 0);
    IP4_ADDR(&gw, 192, 168, 1, 1);
    netif_set_addr(pnetif, &ipaddr, &netmask, &gw);
    
    dhcps_deinit();
    IP4_ADDR(&ipaddr_pool_start, 192, 168, 1, 100);
    IP4_ADDR(&ipaddr_pool_end, 192, 168, 1, 115); /** limited to only 16 client */
    dhcps_set_addr_pool(1, &ipaddr_pool_start, &ipaddr_pool_end); 
    dhcps_init(pnetif);


    int channel = 6;
    int ret     = 0;
    
	if((rltk_wlan_running(WLAN0_IDX) != 0) ||
		(rltk_wlan_running(WLAN1_IDX) != 0)) {
		/** disable auto reconnect */
#if CONFIG_AUTO_RECONNECT
        wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
#endif
    }

#if CONFIG_AUTO_RECONNECT
    wifi_wait_auto_reconnect();
#endif

    /** avoid wifi_off send wifi disconnect event */
    wifi_unreg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);

    wifi_off();
    rtw_mdelay_os(20);

    if (wifi_on(RTW_MODE_AP) < 0) {
        LOGE(TAG, "Wifi on failed!");
        return -1;
    }

    //  wifi_disable_powersave();//add to close powersave
    if (channel > 14) {
        LOGE(TAG, "Invalid Channel,plese check!\r\n");
        channel = 1;
    }

    if (strlen(config->password) > 0) {
        /** Start AP with WPA/WPA2 */
        if (wifi_start_ap((char *)config->ssid, RTW_SECURITY_WPA2_AES_PSK, (char *)config->password,
                          strlen((const char *)config->ssid),
                          strlen((const char *)config->password), channel) != RTW_SUCCESS) {
            LOGE(TAG, "wifi start ap mode failed!\n\r");
            return -1;
        }
    } else {
        /** Start AP with open mode */
        if (wifi_start_ap((char *)config->ssid, RTW_SECURITY_OPEN, NULL,
                          strlen((const char *)config->ssid), 0, channel) != RTW_SUCCESS) {
            LOGE(TAG, "wifi start ap mode failed!\n\r");
            return -1;
        }
    }

    while (1) {
        char essid[33];

        if (wext_get_ssid(WLAN0_NAME, (unsigned char *)essid) > 0) {
            if (strcmp((const char *)essid, (const char *)config->ssid) == 0) {
                LOGD(TAG, "%s started\n", config->ssid);
                ret = 0;
                break;
            }
        }

        if (timeout == 0) {
            LOGE(TAG, "Start AP timeout!\n\r");
            ret = -1;
            break;
        }

        aos_msleep(1000);
        timeout--;
    }
    
    netif_set_link_up(&xnetif[0]);

    return ret;
}

/**
    The wifi mode is controlled by the global variable 'wifi_mode'
*/
static int rtl8723ds_set_mode(rvm_dev_t *dev, rvm_hal_wifi_mode_t mode)
{
    DRIVER_INVALID_RETURN_VAL;

    rtw_mode_t rtw_mode;

    switch (mode) {
        case WIFI_MODE_NULL:
            rtw_mode = RTW_MODE_NONE;
            break;

        case WIFI_MODE_STA:
            rtw_mode = RTW_MODE_STA;
            break;

        case WIFI_MODE_AP:
            rtw_mode = RTW_MODE_AP;
            break;

        case WIFI_MODE_APSTA:
            rtw_mode = RTW_MODE_STA_AP;
            break;

        case WIFI_MODE_P2P:
            rtw_mode = RTW_MODE_P2P;
            break;

        case WIFI_MODE_MAX:
        default:
            rtw_mode = RTW_MODE_NONE;
            LOGE(TAG, "ERR mode\n");
    }

    wifi_mode = rtw_mode;

    wifi_off();
    rtw_mdelay_os(20);
    wifi_on(wifi_mode);

    return 0;
}

static int rtl8723ds_get_mode(rvm_dev_t *dev, rvm_hal_wifi_mode_t *mode)
{
    DRIVER_INVALID_RETURN_VAL;

    switch (wifi_mode) {
        case RTW_MODE_NONE:
            *mode = WIFI_MODE_NULL;
            break;

        case RTW_MODE_STA:
            *mode = WIFI_MODE_STA;
            break;

        case RTW_MODE_AP:
            *mode = WIFI_MODE_AP;
            break;

        case RTW_MODE_STA_AP:
            *mode = WIFI_MODE_APSTA;
            break;

        case RTW_MODE_P2P:
            *mode = WIFI_MODE_P2P;
            break;
    }

    return 0;
}

static int rtl8723ds_install_event_cb(rvm_dev_t *dev, rvm_hal_wifi_event_func *evt_func)
{
    DRIVER_INVALID_RETURN_VAL;

    g_evt_func   = evt_func;
    wifi_evt_dev = dev;

    return -1;
}

static int rtl8723ds_init(rvm_dev_t *dev)
{
    //wifi_on();
    return 0;
}

int rtl8723ds_deinit(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    while (sta_task_running) {
#if CONFIG_AUTO_RECONNECT
        wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
#endif
        LOGW(TAG, "%s Wait STA Task Exit!\n", __FUNCTION__);
        aos_msleep(1000);
    }
    /** avoid wifi_off send wifi disconnect event */
    wifi_unreg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);
    netif_set_link_down(&xnetif[0]);
    return wifi_off();
}

int rtl8723ds_start(rvm_dev_t *dev, rvm_hal_wifi_config_t *config)
{
    DRIVER_INVALID_RETURN_VAL;

    if (config->mode == WIFI_MODE_STA) {
        if (sta_task_running) {
            LOGD(TAG, "ERROR: STA Task Already starting!\n");
            return -1;
        }
        memcpy(&g_config, config, sizeof(rvm_hal_wifi_config_t));
        aos_task_t task_handle;
        sta_task_running        = 1;
        aos_task_new_ext(&task_handle, "wifi_start_sta_task", wifi_start_sta_task, &g_config, 1024 * 10, 35);
    } else if (config->mode == WIFI_MODE_AP) {
        LOGD(TAG, "start softap!\n");
        while (sta_task_running) {
            LOGW(TAG, "%s Wait STA Task Exit!\n", __FUNCTION__);
            aos_msleep(1000);
        }
        if (wifi_start_softap(config) == 0) {
            LOGI(TAG, "SoftAP UP\n");
            //m->ev_cb->stat_chg(m, NOTIFY_AP_UP, NULL);
        } else {
            LOGI(TAG, "SoftAP DOWN\n");
            //m->ev_cb->stat_chg(m, NOTIFY_AP_UP_FAILED, NULL);
        }
    } else {
        LOGD(TAG, "Not supported wifi mode!\n");
    }

