XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
    return 0;
}

int rtl8723ds_stop(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    while (sta_task_running) {
#if CONFIG_AUTO_RECONNECT
        wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
#endif
        LOGI(TAG, "%s Wait STA Task Exit!\n", __FUNCTION__);
        aos_msleep(1000);
    }

    netif_set_link_down(&xnetif[0]);
    return wifi_off();
}

int rtl8723ds_reset(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    while (sta_task_running) {
#if CONFIG_AUTO_RECONNECT
        wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
#endif
        LOGW(TAG, "%s Wait STA Task Exit!\n", __FUNCTION__);
        aos_msleep(1000);
    }
    /** avoid wifi_off send wifi disconnect event */
    wifi_unreg_event_handler(WIFI_EVENT_HANDSHAKE_FAILED, rtl8723ds_handshake_failed_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_DISCONNECT, rtl8723ds_wifi_disconn_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_FOURWAY_HANDSHAKE_DONE, rtl8723ds_wifi_handshake_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_CONNECT, rtl8723ds_wifi_connected_hdl);
    netif_set_link_down(&xnetif[0]);
    return wifi_off();
}

/** conf APIs */
int rtl8723ds_set_lpm(rvm_dev_t *dev, rvm_hal_wifi_lpm_mode_t mode)
{
    DRIVER_INVALID_RETURN_VAL;

    if (mode == WIFI_LPM_NONE) {

        if (g_wifi_lpm_mode == WIFI_LPM_KEEP_LINK) {
            rtw_resume(0);
        } else if (g_wifi_lpm_mode == WIFI_LPM_KEEP_SOCKET) {
            wifi_disable_powersave();
        }
    } else if (mode == WIFI_LPM_KEEP_SOCKET) {
        if (g_wifi_lpm_mode == WIFI_LPM_NONE) {
            wifi_enable_powersave();
        } else if (g_wifi_lpm_mode == WIFI_LPM_KEEP_LINK) {
            rtw_resume(0);
            wifi_enable_powersave();
        }
    } else if (mode == WIFI_LPM_KEEP_LINK) {

        rtw_suspend(0);

    } else {
        return -1;
    }

    g_wifi_lpm_mode = mode;

    return 0;
}

int rtl8723ds_get_lpm(rvm_dev_t *dev, rvm_hal_wifi_lpm_mode_t *mode)
{
    *mode = g_wifi_lpm_mode;
    return 0;
}

int rtl8723ds_set_protocol(rvm_dev_t *dev, uint8_t protocol_bitmap)
{
    DRIVER_INVALID_RETURN_VAL;

    rtw_network_mode_t mode = RTW_NETWORK_B;

    if (protocol_bitmap & (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)) {
        mode = RTW_NETWORK_BGN;
    } else if (protocol_bitmap & (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G)) {
        mode = RTW_NETWORK_BG;
    } else if (protocol_bitmap & (WIFI_PROTOCOL_11B)) {
        mode = RTW_NETWORK_B;
    }

    wifi_set_network_mode(mode);
    return 0;
}

int rtl8723ds_get_protocol(rvm_dev_t *dev, uint8_t *protocol_bitmap)
{
    DRIVER_INVALID_RETURN_VAL;

    rtw_network_mode_t mode = RTW_NETWORK_B;
    wifi_get_network_mode(&mode);

    switch (mode) {
        case RTW_NETWORK_B:
            *protocol_bitmap = (WIFI_PROTOCOL_11B);
            break;

        case RTW_NETWORK_BG:
            *protocol_bitmap = (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G);
            break;

        case RTW_NETWORK_BGN:
            *protocol_bitmap = (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
            break;
    }

    return 0;
}

int rtl8723ds_set_country(rvm_dev_t *dev, rvm_hal_wifi_country_t country)
{
    DRIVER_INVALID_RETURN_VAL;

    rtw_country_code_t rtw_country_code;

    switch (country) {
        case WIFI_COUNTRY_CN:
            rtw_country_code = RTW_COUNTRY_CN;
            break;

        case WIFI_COUNTRY_JP:
            rtw_country_code = RTW_COUNTRY_JP;
            break;

        case WIFI_COUNTRY_US:
            rtw_country_code = RTW_COUNTRY_US;
            break;

        case WIFI_COUNTRY_EU:
            rtw_country_code = RTW_COUNTRY_EU;
            break;

        default:
            rtw_country_code = RTW_COUNTRY_CN;
    }

    g_country = rtw_country_code;
    return wifi_set_country(rtw_country_code);
}

int rtl8723ds_get_country(rvm_dev_t *dev, rvm_hal_wifi_country_t *country)
{
    DRIVER_INVALID_RETURN_VAL;

    switch (g_country) {
        case RTW_COUNTRY_CN:
            *country = WIFI_COUNTRY_CN;
            break;

        case RTW_COUNTRY_JP:
            *country = WIFI_COUNTRY_JP;
            break;

        case RTW_COUNTRY_US:
            *country = WIFI_COUNTRY_US;
            break;

        case RTW_COUNTRY_EU:
            *country = WIFI_COUNTRY_EU;
            break;

        default:
            *country = WIFI_COUNTRY_CN;
    }

    return 0;
}

/**
    When wifi is disconnected, judge if reconnect wifi
*/
int rtl8723ds_set_auto_reconnect(rvm_dev_t *dev, bool en)
{
    DRIVER_INVALID_RETURN_VAL;

#if CONFIG_AUTO_RECONNECT
    if (en)
        wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
    else
        wifi_set_autoreconnect(RTW_AUTORECONNECT_FINITE);

    return 0;
#else
    return -1;
#endif
}

int rtl8723ds_get_auto_reconnect(rvm_dev_t *dev, bool *en)
{
    DRIVER_INVALID_RETURN_VAL;

#if CONFIG_AUTO_RECONNECT
    unsigned char enable;

    wifi_get_autoreconnect(&enable);
    if (enable != RTW_AUTORECONNECT_DISABLE)
        *en = 1;
    else
        *en = 0;
    return 0;
#else
    return -1;
#endif
}

int rtl8723ds_power_on(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    return wifi_rf_on();
}

int rtl8723ds_power_off(rvm_dev_t *dev)
{
    return wifi_rf_off();
}

static void rtl8723ds_scan_done_hdl(char *buf, int buf_len, int flags, void *userdata)
{

    LOGD(TAG, "scan done!\n");
    int *scan_done = (int *)userdata;

    if (g_evt_func && wifi_evt_dev)
        g_evt_func->scan_compeleted(wifi_evt_dev, scan_count, g_ap_records);
    *scan_done     = 1;
}

static void rtl8723ds_get_security_scan_done_hdl(char *buf, int buf_len, int flags, void *userdata)
{

    LOGD(TAG, "scan done!\n");
    int *scan_done = (int *)userdata;

    *scan_done     = 1;
}

/**
    There may be duplicate entry comes in, replace old with new
*/
void rtl8723ds_scan_report_hdl(char *buf, int buf_len, int flags, void *userdata)
{
    int i = 0;
    //int j = 0;
    //int insert_pos = 0;
    rvm_hal_wifi_ap_record_t *    ap_records = userdata;
    rtw_scan_result_t *record = *(rtw_scan_result_t **)buf;
#if 0
    LOGD(TAG, "SSID=%s BSSID=%02x:%02x:%02x:%02x:%02x:%02x\n",
           record->SSID.val,
           record->BSSID.octet[0],
           record->BSSID.octet[1],
           record->BSSID.octet[2],
           record->BSSID.octet[3],
           record->BSSID.octet[4],
           record->BSSID.octet[5]);
#endif

    /** filtering out already exist record */
    for (i = 0; i < scan_count; i++) {
        rvm_hal_wifi_ap_record_t *ap_record = &ap_records[i];
        if (memcmp(ap_record->bssid, record->BSSID.octet, 6) == 0) {
            if (record->signal_strength > ap_record->rssi) {
                ap_record->rssi = record->signal_strength;
            }
            return;
        }
    }

