XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
    if (scan_count >= MAX_AP_RECORD - 1) {
        LOGE(TAG, "Too many AP!\n");
        return;
    }
    rvm_hal_wifi_ap_record_t *ap_record = &ap_records[scan_count++];
    memcpy(ap_record->ssid, record->SSID.val, record->SSID.len);
    memcpy(ap_record->bssid, record->BSSID.octet, 6);
    ap_record->channel = record->channel;
    ap_record->rssi    = record->signal_strength;

    switch (record->security) {
        case RTW_SECURITY_OPEN:
            ap_record->encryptmode = WIFI_ENC_OPEN;
            ap_record->authmode    = WIFI_AUTH_OPEN;
            break;

        case RTW_SECURITY_WEP_PSK:
            ap_record->encryptmode = WIFI_ENC_WEP;
            ap_record->authmode    = WIFI_AUTH_OPEN;
            break;

        case RTW_SECURITY_WEP_SHARED:
            ap_record->encryptmode = WIFI_ENC_WEP;
            ap_record->authmode    = WIFI_AUTH_WEP;
            break;

        case RTW_SECURITY_WPA_TKIP_PSK:
            ap_record->encryptmode = WIFI_ENC_TKIP;
            ap_record->authmode    = WIFI_AUTH_WPA_PSK;
            break;

        case RTW_SECURITY_WPA_AES_PSK:
            ap_record->encryptmode = WIFI_ENC_AES;
            ap_record->authmode    = WIFI_AUTH_WPA_PSK;
            break;

        case RTW_SECURITY_WPA2_AES_PSK:
            ap_record->encryptmode = WIFI_ENC_AES;
            ap_record->authmode    = WIFI_AUTH_WPA2_PSK;
            break;

        case RTW_SECURITY_WPA2_TKIP_PSK:
            ap_record->encryptmode = WIFI_ENC_TKIP;
            ap_record->authmode    = WIFI_AUTH_WPA2_PSK;
            break;

        case RTW_SECURITY_WPA2_MIXED_PSK:
            ap_record->encryptmode = WIFI_ENC_TKIP_AES_MIX;
            ap_record->authmode    = WIFI_AUTH_WPA2_PSK;
            break;

        case RTW_SECURITY_WPA_WPA2_MIXED:
            ap_record->encryptmode = WIFI_ENC_TKIP_AES_MIX;
            ap_record->authmode    = WIFI_AUTH_WPA_WPA2_PSK;
            break;

        default:
            LOGE(TAG, "WiFi encrypt not support = %d\n", record->security);
            ap_record->encryptmode = WIFI_ENC_MAX;
            ap_record->authmode    = WIFI_AUTH_MAX;
    }

    return;
}

static int rtl8723ds_block_scan()
{
    int ret = 0;

    static int scan_done;
    static int scan_running;

    if (scan_running) {
        LOGE(TAG, "scan in progress\n");
        return -1;
    }
    scan_running = 1;

    int scan_type = RTW_SCAN_COMMAMD << 4 | RTW_SCAN_TYPE_ACTIVE;
    int bss_type  = RTW_BSS_TYPE_ANY;
    u16 flags     = scan_type | (bss_type << 8);
    scan_done     = 0;

    g_ap_records = aos_zalloc(sizeof(rvm_hal_wifi_ap_record_t) * MAX_AP_RECORD);
    scan_count = 0;

    wifi_reg_event_handler(WIFI_EVENT_SCAN_RESULT_REPORT, rtl8723ds_scan_report_hdl, g_ap_records);
    wifi_reg_event_handler(WIFI_EVENT_SCAN_DONE, rtl8723ds_scan_done_hdl, &scan_done);
    ret = wext_set_scan(WLAN0_NAME, NULL, 0, flags);

    while (scan_done == 0)
        aos_msleep(100);

    //ret = wext_get_scan(WLAN0_NAME, NULL, 0);
    wifi_unreg_event_handler(WIFI_EVENT_SCAN_DONE, rtl8723ds_scan_done_hdl);
    wifi_unreg_event_handler(WIFI_EVENT_SCAN_RESULT_REPORT, rtl8723ds_scan_report_hdl);
    //LOGD(TAG, "scan count=(All=%d, not duplicate=%d)\n", ret, scan_count);

    scan_running = 0;
    aos_free(g_ap_records);

    return ret;
    //#endif
}

/**
    TBD, scan with scan config
*/
static int rtl8723ds_start_scan(rvm_dev_t *dev, wifi_scan_config_t *config, bool block)
{
    int ret = 0;
    DRIVER_INVALID_RETURN_VAL;

    //only support block mode now
    if (block == 0)
        return -1;

    wifi_set_sta_mode();

#if 0
    if ((ret = wifi_scan_networks(wifi_scan_result_handler, NULL)) != RTW_SUCCESS) {
        LOGD(TAG, "[ATWS]ERROR: wifi scan failed\n\r");
        goto exit;
    }
#else
    ret = rtl8723ds_block_scan();
#endif

    //exit:
    return ret;
}

static int rtl8723ds_sta_get_link_status(rvm_dev_t *dev, rvm_hal_wifi_ap_record_t *ap_info)
{
    DRIVER_INVALID_RETURN_VAL;

    const char *       ifname[2] = {WLAN0_NAME, WLAN1_NAME};
    rtw_wifi_setting_t setting;
    //int rssi = 0;
    int channel = 0;

    if (wifi_is_connected_to_ap() == RTW_SUCCESS) {
        ap_info->link_status = WIFI_STATUS_LINK_UP;
    } else {
        ap_info->link_status = WIFI_STATUS_LINK_DOWN;
        return 0;
    }

    wifi_get_setting((const char *)ifname[0], &setting);
    //wifi_show_setting((const char *)ifname[0], &setting);
    strcpy((char*)ap_info->ssid, (char*)setting.ssid);

    if (wifi_get_ap_bssid(ap_info->bssid) == RTW_ERROR)
        LOGE(TAG, "AP SSID Get Failed\n");
    wifi_get_rssi((int*)&ap_info->rssi);
    wifi_get_channel(&channel);

    ap_info->channel = channel;

    return 0;
}

int rtl8723ds_ap_get_sta_list(rvm_dev_t *dev, rvm_hal_wifi_sta_list_t *sta)
{
    DRIVER_INVALID_RETURN_VAL;

    int i;
    struct {
        int       count;
        rtw_mac_t mac_list[AP_STA_NUM];
    } client_info;

    client_info.count = AP_STA_NUM;
    wifi_get_associated_client_list(&client_info, sizeof(client_info));

    LOGD(TAG, "\n\rAssociated Client List:");
    LOGD(TAG, "\n\r==============================");

    sta->num = client_info.count;

    if (client_info.count == 0) {
        LOGD(TAG, "\n\rClient Num: 0\n\r");
    } else {
        LOGD(TAG, "\n\rClient Num: %d", client_info.count);

        for (i = 0; i < client_info.count; i++) {
            if (i >= HAL_WIFI_MAX_CONN_NUM) {
                LOGD(TAG, "WiFi connection exceeds max number of HAL\n");
                break;
            }

            memcpy(sta->sta[i].mac, client_info.mac_list[i].octet, 6);

            LOGD(TAG, "\n\rClient [%d]:", i);
            LOGD(TAG, "\n\r\tMAC => " MAC_FMT "", MAC_ARG(client_info.mac_list[i].octet));
        }

        LOGD(TAG, "\n\r");
    }

    return 0;
}

static int frame_handler(const unsigned char* frame_buf, unsigned int frame_len)
{
#ifdef WIFI_PORTING_DISABLED
    return 0;
#endif

    g_monitor_mgnt_cb((uint8_t*)frame_buf, frame_len);

    return 0;
}

int rtl8723ds_start_mgnt_monitor(rvm_dev_t *dev, rvm_hal_wifi_mgnt_cb_t cb)
{
    DRIVER_INVALID_RETURN_VAL;

