XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
#if CONFIG_AUTO_RECONNECT
    wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
    wifi_wait_auto_reconnect();
#endif
    while (sta_task_running) {
        LOGI(TAG, "%s Wait STA Task Exit!\n", __FUNCTION__);
        aos_msleep(1000);
    }

    g_monitor_mgnt_cb = cb;

    wext_enable_rawdata_recv(WLAN0_NAME, (void*)frame_handler);

    return 0;
}

int rtl8723ds_stop_mgnt_monitor(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    wext_disable_rawdata_recv(WLAN0_NAME);

    return 0;
}

int rtl8723ds_start_monitor(rvm_dev_t *dev, rvm_hal_wifi_promiscuous_cb_t cb)
{
    DRIVER_INVALID_RETURN_VAL;

#if CONFIG_AUTO_RECONNECT
    wifi_set_autoreconnect(RTW_AUTORECONNECT_DISABLE);
    wifi_wait_auto_reconnect();
#endif
    while (sta_task_running) {
        LOGI(TAG, "%s Wait STA Task Exit!\n", __FUNCTION__);
        aos_msleep(1000);
    }

    g_monitor_cb = cb;

    wifi_enter_promisc_mode();
    wifi_set_promisc(RTW_PROMISC_ENABLE_2, wifi_promisc_hdl, 0);

    return 0;
}

int rtl8723ds_stop_monitor(rvm_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    wifi_set_promisc(RTW_PROMISC_DISABLE, NULL, 0);

    return 0;
}

int rtl8723ds_set_channel(rvm_dev_t *dev, uint8_t primary, rvm_hal_wifi_second_chan_t second)
{
    DRIVER_INVALID_RETURN_VAL;

    return wifi_set_channel(primary);
}

int rtl8723ds_get_channel(rvm_dev_t *dev, uint8_t *primary, rvm_hal_wifi_second_chan_t *second)
{
    DRIVER_INVALID_RETURN_VAL;

    int channel;
    if (wifi_get_channel(&channel) == 0) {
        *primary = channel;
        return 0;
    } else {
        return -1;
    }
}

static int rtl8723ds_send_80211_raw_frame(rvm_dev_t *dev, void *buffer, uint16_t len)
{
    DRIVER_INVALID_RETURN_VAL;

    int         ret    = 0;
    const char *ifname = WLAN0_NAME;

    ret = wext_send_mgnt(ifname, (char *)buffer, len, 1);
    return ret;
}

static wifi_driver_t rtl8723ds_wifi_driver = {
    /** basic APIs */

    .init             = rtl8723ds_init,
    .deinit           = rtl8723ds_deinit,
    .reset            = rtl8723ds_reset,
    .set_mode         = rtl8723ds_set_mode,
    .get_mode         = rtl8723ds_get_mode,
    .install_event_cb = rtl8723ds_install_event_cb,

    .set_protocol        = rtl8723ds_set_protocol,
    .get_protocol        = rtl8723ds_get_protocol,
    .set_country         = rtl8723ds_set_country,
    .get_country         = rtl8723ds_get_country,
    .set_mac_addr        = rtl8723ds_set_mac_addr,
    .get_mac_addr        = rtl8723ds_get_mac_addr,
    .set_auto_reconnect  = rtl8723ds_set_auto_reconnect,
    .get_auto_reconnect  = rtl8723ds_get_auto_reconnect,
    .set_lpm             = rtl8723ds_set_lpm,
    .get_lpm             = rtl8723ds_get_lpm,
    .power_on            = rtl8723ds_power_on,
    .power_off           = rtl8723ds_power_off,
    .start_scan          = rtl8723ds_start_scan,
    .start               = rtl8723ds_start,
    .stop                = rtl8723ds_stop,
    .sta_get_link_status = rtl8723ds_sta_get_link_status,
    .ap_get_sta_list     = rtl8723ds_ap_get_sta_list,

    /** promiscuous APIs */
    .start_monitor        = rtl8723ds_start_monitor,
    .stop_monitor         = rtl8723ds_stop_monitor,
    .start_mgnt_monitor   = rtl8723ds_start_mgnt_monitor,
    .stop_mgnt_monitor    = rtl8723ds_stop_mgnt_monitor,
    .send_80211_raw_frame = rtl8723ds_send_80211_raw_frame,
    .set_channel          = rtl8723ds_set_channel,
    .get_channel          = rtl8723ds_get_channel,

    .set_smartcfg = NULL,
};

#endif

#define RTL8723DS_DRIVER
#ifdef RTL8723DS_DRIVER
static rvm_dev_t *rtl8723ds_dev_init(driver_t *drv, void *config, int id)
{
    rvm_dev_t *dev = rvm_hal_device_new(drv, sizeof(wifi_dev_t), id);

    return dev;
}

static void rtl8723ds_dev_uninit(rvm_dev_t *dev)
{
    aos_check_param(dev);

    rvm_hal_device_free(dev);
}

static int rtl8723ds_dev_open(rvm_dev_t *dev)
{
    return 0;
}

static int rtl8723ds_dev_close(rvm_dev_t *dev)
{
    return 0;
}
#endif

static netdev_driver_t rtl8723ds_driver = {
    .drv =
        {
            .name   = "wifi",
            .init   = rtl8723ds_dev_init,
            .uninit = rtl8723ds_dev_uninit,
            .open   = rtl8723ds_dev_open,
            .close  = rtl8723ds_dev_close,
        },
    .link_type = NETDEV_TYPE_WIFI,
    .net_ops   = &rtl8723ds_net_driver,
    .link_ops  = &rtl8723ds_wifi_driver,
};

#if 0
static void rtl8723ds_cut_off_gpio(int gpio)
{
    LOGD(TAG, "Turn off %d\n", gpio);
    drv_pinmux_config(gpio, PIN_FUNC_GPIO);
    gpio_pin_handle_t pin = csi_gpio_pin_initialize(gpio, NULL);
    csi_gpio_pin_config_mode(pin, GPIO_MODE_PULLNONE);
    csi_gpio_pin_config_direction(pin, GPIO_DIRECTION_INPUT);
    //csi_gpio_pin_write(pin, 1);
}
#endif

/**
 * @brief  register wifi driver of rtl8723 
 * @param  [in] config
 * @return  
 */
void wifi_rtl8723ds_register(rtl8723ds_gpio_pin *config)
{
    if (config) {
        memcpy(&g_gpio_config, config, sizeof(rtl8723ds_gpio_pin));
    } else {
        LOGE(TAG, "Err:Please input gpio config\n");
        return;
    }

#ifdef CONFIG_CSI_V2
    if (config->power != 0xFFFFFFFF) {
        LOGD(TAG, "pull up WLAN power\n");
        csi_pin_set_mux(g_gpio_config.power, PIN_FUNC_GPIO);
        csi_gpio_pin_t power_pin;
        csi_gpio_pin_init(&power_pin, g_gpio_config.power);
        csi_gpio_pin_mode(&power_pin, GPIO_MODE_PULLNONE);
        csi_gpio_pin_dir(&power_pin, GPIO_DIRECTION_OUTPUT);
        csi_gpio_pin_write(&power_pin, GPIO_PIN_HIGH);
        aos_msleep(200);
    }
    if (config->wl_en != 0xFFFFFFFF) {
        LOGD(TAG, "Init WLAN enable\n");
        csi_pin_set_mux(g_gpio_config.wl_en, PIN_FUNC_GPIO);
        csi_gpio_pin_t wl_en_pin;
        csi_gpio_pin_init(&wl_en_pin, g_gpio_config.wl_en);
        csi_gpio_pin_mode(&wl_en_pin, GPIO_MODE_PULLNONE);
        csi_gpio_pin_dir(&wl_en_pin, GPIO_DIRECTION_OUTPUT);
        csi_gpio_pin_write(&wl_en_pin, GPIO_PIN_LOW);
        aos_msleep(50);
        csi_gpio_pin_write(&wl_en_pin, GPIO_PIN_HIGH);
        aos_msleep(50);
    }
#else
    gpio_pin_handle_t wl_en_pin;

