XUANTIE-RV/open-yoc/components/drv_wifi_rtl8723ds/rtl8723ds_devops.c
    /** main power up*/
    if (config->power != 0xFFFFFFFF) {
        LOGD(TAG, "pull up WLAN power\n");
        drv_pinmux_config(g_gpio_config.power, PIN_FUNC_GPIO);
        power_pin = csi_gpio_pin_initialize(g_gpio_config.power, NULL);
        csi_gpio_pin_config_mode(power_pin, GPIO_MODE_PULLNONE);
        csi_gpio_pin_config_direction(power_pin, GPIO_DIRECTION_OUTPUT);
        csi_gpio_pin_write(power_pin, 1);
        aos_msleep(200);
    }

    /** WL_EN */
    if (config->wl_en != 0xFFFFFFFF) {
        LOGD(TAG, "Init WLAN enable\n");
        drv_pinmux_config(g_gpio_config.wl_en, PIN_FUNC_GPIO);
        wl_en_pin = csi_gpio_pin_initialize(g_gpio_config.wl_en, NULL);
        csi_gpio_pin_config_mode(wl_en_pin, GPIO_MODE_PULLNONE);
        csi_gpio_pin_config_direction(wl_en_pin, GPIO_DIRECTION_OUTPUT);
        csi_gpio_pin_write(wl_en_pin, 0);
        aos_msleep(50);
        csi_gpio_pin_write(wl_en_pin, 1);
        aos_msleep(50);
    }
#endif    

    extern SDIO_BUS_OPS rtw_sdio_bus_ops;
    rtw_sdio_bus_ops.bus_probe(config->sdio_idx);

    LwIP_Init();

    wifi_manager_init();

    rvm_driver_register(&rtl8723ds_driver.drv, NULL, 0);
}

void rtl8723ds_wifi_test()
{
    while (1) {

        int total = 0, used = 0, mfree = 0, peak = 0;
        aos_get_mminfo(&total, &used, &mfree, &peak);
        LOGD(TAG, "                total   used   free   peak \r\n");
        LOGD(TAG, "memory usage: %7d%7d%7d%7d\r\n\r\n", total, used, mfree, peak);

        wifi_off();
        rtw_mdelay_os(20);
        wifi_on(RTW_MODE_STA);

        aos_msleep(5000);
    }
}
